---
kind: method
id: M:Autodesk.Revit.DB.BarTypeDiameterOptions.Dispose
source: html/024faa95-cc70-99fb-a29d-3e217625526e.htm
---
# Autodesk.Revit.DB.BarTypeDiameterOptions.Dispose Method

Releases all resources used by the BarTypeDiameterOptions

## Syntax (C#)
```csharp
public void Dispose()
```